var arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

//slice不改变原数组
console.log(arr.slice(1)); //返回第1位到結束
console.log(arr.slice(1, 4)); //返回第1位到第四位
//两个参数还可以用负数哟 用负数的话就是:数组的长度 + 负数,来确定位置从哪里开始，从哪里结束
console.log(arr.slice(-4,-2))//[7, 8] .....这个就是从  10-4 开始   10-2结束
console.log(arr.slice(-2,-4))//[] ..... 这个就是从   10-2 开始    10-4  结束

console.log("-----------------------------------")
/**
 * splice()方法应该是最强大的数组方法了
 * 主要用途是向数组的中部插入项，参数有三个，一个是起始位置，第二个是删除，插入的项数，第三个是要插入的项
 */
console.log(arr.splice(0, 2, 20)); //返回了要删除的项
console.log(arr); //他改变了原来的数组

var arr2 = [1,2,3,4,5,6];//插入任意的数量项
console.log(arr2.splice(6,0,7,8,9))//[]
console.log(arr2)//[1, 2, 3, 4, 5, 6, 7, 8, 9]

var arr3 = [1,2,3,4,5,6];//向指定位置插入任意数量的项，并删掉任意数量的项
console.log(arr3.splice(1,2,7,8))//[2, 3]
console.log(arr3)//[1, 7, 8, 4, 5, 6]
